english/part.md

# Table of Contents

-   [语义](#orgeb5b1b5)
-   [短语](#orgdc845f0)

一部分零件要分手了


<a id="orgeb5b1b5"></a>

# 语义


## 部分

The front part of the car was damaged.


## 零件

Lay all the parts out before you start assembling the model.


## 局部

Part of the money will be spent on a new playground.


## 角色

Could someone take the part of Romeo, please?


## 音部

The violin part is diffcult.


## 份

Prepare the glue with one part powder to three parts water.


## 使分开

When he parted the curtains, the sunlight flooded into the room.


## 分手

They parted on **amicable** terms.


## 和&#x2026;分离

They were hardly ever parted in 30 years of marriage.


## 部分地

The project is part funded by the council.


<a id="orgdc845f0"></a>

# 短语


## play a part

Health education will play a part in preparing us for old age.

<https://youglish.com/getbyid/20909612/play%20a%20part/english>


## take part

About 400 students took part in the protest.

<https://youglish.com/getbyid/19708468/take%20part/english>


## want no part of

There was a plan to change the production style, and he wanted no part of it.

<https://youglish.com/getbyid/20173165/want%20no%20part%20of/english>


## in part

His reluctance to help could, in part, be explained by his poor eyesight.

<https://youglish.com/getbyid/4837430/in%20part/english>


## be part of

Falling over is part of learning how to ski.

<https://youglish.com/getbyid/19695656/be%20part%20of/english>


## look the part


### 看上去样子像

In his smart suit, he certainly looked the part.

<https://youglish.com/getbyid/121302744/look%20the%20part/english>


### 崭露头角

He's beginning to look the part on the soccer field.


## dress the part

She's got a new high-powered job, and she's certainly dressing the part.

<https://youglish.com/getbyid/60481559/dress%20the%20part/english>


## in these parts

We don't get many tourists in these parts.

<https://youglish.com/getbyid/77998112/in%20these%20parts/english>


## take somebody's part

Dad always takes my brother's part when we argue.


## for my part

For my part, I prefer living in the country.

<https://youglish.com/getbyid/68315288/for%20my%20part/english>


## be part and parcel of something

Working irregular hours is all part and parcel of being a journalist.

<https://youglish.com/getbyid/22601547/be%20part%20and%20parcel%20of/english>


## man of many parts

He was a man of many parts: writer, literary critic and historian.

<https://youglish.com/getbyid/8171884/man%20of%20many%20parts/english>


## part company


### 分道而行

The two women parted company outside their rooms.

<https://youglish.com/getbyid/34061772/part%20company/english>


### 断绝关系

Georage parted company with the band in 1996.

<https://youglish.com/getbyid/102877846/part%20company/english>


### 意见不合

He parted company with Lloyd George over post-war **diplomacy**.

<https://youglish.com/getbyid/25603064/part%20company/english>


## part with

I'm reluctant to part with any of the kittens, but we need the money.

<https://youglish.com/getbyid/21333181/part%20with/english>
